{
  "watchLists": [
    {
      "author": "Damien",
      "label": "new  movie",
      "id": 1
    }
  ],
  "movies": [
    {
      "title": "The Shawshank Redemption",
      "poster_path": "/hBcY0fE9pfXzvVaY4GKarweriG2.jpg",
      "overview": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
      "watchlist_ID": 1,
      "id": 1
    },
    {
      "title": "Creed III",
      "poster_path": "/cvsXj3I9Q2iyyIo95AecSd1tad7.jpg",
      "overview": "After dominating the boxing world, Adonis Creed has been thriving in both his career and family life. When a childhood friend and former boxing prodigy, Damien Anderson, resurfaces after serving a long sentence in prison, he is eager to prove that he deserves his shot in the ring. The face-off between former friends is more than just a fight. To settle the score, Adonis must put his future on the line to battle Damien - a fighter who has nothing to lose.",
      "watchlist_ID": 1,
      "id": 4
    },
    {
      "title": "Sayen",
      "poster_path": "/aCy61aU7BMG7SfhkaAaasS0KzUO.jpg",
      "overview": "Sayen is hunting down the men who murdered her grandmother. Using her training and knowledge of nature, she is able to turn the tables on them, learning of a conspiracy from a corporation that threatens her people's ancestral lands.",
      "watchlist_ID": 1,
      "id": 5
    },
    {
      "title": "Black Panther: Wakanda Forever",
      "poster_path": "/sv1xJUazXeYqALzczSZ3O6nkH75.jpg",
      "overview": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
      "watchlist_ID": 1,
      "id": 7
    }
  ]
}